package classifier
 
import scala.collection.mutable.ListBuffer

object VirtualData {
	val datalist=ListBuffer((true,"成功"),(false,"失敗"))
	val examlist=ListBuffer("失敗成功","彼は私に気があるのでしょうか？",
	    """
もしうまくいっても、４月から私は東京に戻ってしまいます。
それに教習所の先生はもてますよね…。
私は今まで誰かと付き合ったことがないのでよくわかりません。
これは、やめておいた方がいい恋なのでしょうか？
	    ""","""
	    初めまして３０代後半の男です。
　私は、職場で２つ下の女性のことがとても好きです。私が彼女を好きであることを彼女も分かっています。しかし、彼女にはその気がありません。
私が、食事に２度ほど誘っても返事はNOです。また、彼女が仕事で頑張った時には、折り紙を折って褒める内容の手紙を書いたり、彼女が仕事でしんどいだろうなという時には、励ましのメールを３回ほど出しましたが返事がきません。
　ただ、私のことは男としては見れないとは思いますが、人柄というか人間性のようなものは認めているらしく、
「〇〇さんには、〇〇さんの良さがありますから人とは比べないで下さい。」
と言ってくれたり、私を認めてくれるようなことも言ってくれたりします。
そして、仕事上では、良い人間関係を築けていると思います。

　そんな彼女の態度もあってか、私も「他ににいい人を見つけなくては」と思い、他の２人の女性と会っていましたが、結局その彼女のことをいつも考えている自分がいて、他の女性にも失礼かと思い会うことをやめました。
　
　彼女も、年齢的なこともあり結婚や出産のことをとても焦っています。誰でもいいわけではもちろんありませんが、結婚をしたいようです。私も年齢的なこともあり、脈のない子にいつまでも想いを寄せているのは時間の無駄だと女友達からは言われますが、自分でもなかなか踏ん切りが尽きません。　
　しかし、告白もせずに彼女に彼氏ができたら後悔してもしきれないと思います。そして自分の気持ちを消すことがやっぱりできずにいる自分がいます。けれど、彼女からしてみたら「無理だというサインを出しているのに、何で告白してきたの？仕事がしにくくなるし迷惑だよな。」と思うと躊躇してしまいます。

自分の気持ちに踏ん切りをつけるために告白すべきでしょうか？アドバイスをお願いします。
	    """)
}